<template>
    <div>
        <mark-down class="content">
            

## Cursor IDE를 활용한 AI기반 코딩
다양한 AI 코딩 도구를 통해 반자율부터 전자율, 멀티 에이전트까지 구현 가능하며, 운영 단계에서는 자동 지원을 받을 수 있고 이를 통해 코드 문서화, 재작업 시간 딘축 및 오류를 줄일 수 있다는 장점이 있습니다.
또한 코드 품질, 디자인패턴 적용, 레거시 코드 파악 등 다양한 측면에서 활용이 가능합니다.

다음은 Cursor IDE를 활용하여 AI기반 코딩을 진행하는 방법입니다.

### Cursor 환경 및 OPEN AI 환경 구축

먼저 Cursor IDE를 사용할 환경을 구축해야합니다.
- https://cursor.sh/ 로 접속하여 우측 상단에 위치한 'Download'버튼을 클릭하여 다운로드를 완료하면 Cursor를 이용할 수 있습니다.

- Cursor를 실행하면 다음과 같은 화면이 나타나며, 'Open a folder'를 클릭하여 실행할 프로젝트 폴더를 선택합니다.

- 선택 후, 좌측 영역에 우클릭 > 새 파일 > 'index.html' 입력 > 'Enter'로 파일을 생성합니다.

- index.html 파일 클릭 > Ctrl + L 을 진행하면 Cursor화면 우측에 OPEN AI가 활성화되며 여기서 코드 생성 및 수정 등을 지원받을 수 있습니다.

다음은 OPEN AI를 통해 피자가게 주문 화면을 적용하는 방법입니다.

- OPEN AI가 활성화된 상태에서 질문 영역에 '피자가게의 주문받기 화면'을 입력하면 다음과 같은 코드가 생성됩니다. 이때, 동일한 프롬프트에도 상이한 결과값이 생성될 수 있기에 코드에 대한 평가 후 적용하거나 다시 생성을 진행해야합니다.

- 적용의 경우, 생성된 코드 우측의 '+ Apply diff'를 클릭 > 'Apply to current file'을 클릭하면 생성된 코드가 index.html 파일에 적용된 것을 확인할 수 있습니다.

- 이후 적용된 파일을 탐색기에서 실행하면 생성된 코드에 따른 화면이 구성된 것을 확인할 수 있습니다.

생성된 코드에 대하여 요구사항이 추가될 경우 두 가지 방법을 이용할 수 있습니다.
다음은 기존 생성된 코드에 '불고기 피자를 추가해줘' 라는 요구사항을 추가하는 방법입니다.

- 첫 번째는 이전에 질문한 내용의 하단에 요구사항을 프롬프트로 보내면 이전의 답변에 요구사항을 추가한 결과값을 확인할 수 있습니다.

- 두 번째는 Ctrl + K 를 눌러 요구사항 '불고기 피자를 추가해줘'를 입력하면 전체 코드를 읽어 필요한 부분에 대하여 수정이 진행되며 수정된 내용을 적용할지에 대하여 선택할 수 있습니다.

Cursor의 OPEN AI는 멘션(@) 기능을 통해 프롬프트에 참고자료를 첨부할 수 있습니다.
다음은 생성한 피자가게 주문 화면에 멘션을 통해 문서를 추가하여 프롬프팅하는 방법입니다.

- index.html 파일에서 Ctrl + L > '@' 입력 > 'Docs' > 'Add new doc' >  https://getbootstrap.com/ 입력 > 'Confirm'을 클릭하면 OPEN AI에서 인덱싱을 진행하며 해당 웹사이트에 대한 정보를 가진 채로 질문 할 수 있습니다.
이후, 추가할 요구사항을 다음과 같이 입력합니다.

```
@Bootstrap 
부트스트랩을 적용해줘.
카드 레이아웃으로 메뉴들을 표시
이미지를 placeholder.com으로 대체
```
문서 이외에도 이미지를 프롬프트에 첨부할 수 있으며 다음과 같이 진행할 수 있습니다.

- index.html 파일에서 Ctrl + L > 'image' 클릭 > 이미지 첨부 후 이미지에 맞는 요구사항을 프롬프트를 추가하면 이미지의 정보와 프롬프트의 내용을 토대로 생성된 결과값을 확인할 수 있습니다.

        </mark-down>

    </div>
</template>


<script>
    // @group 01_01_02
    export default {
        name:'IDE',
        data() {
            return {}
        },
        props: {
            "Cursor를 활용한 AI기반 코딩": {
                type: String
            },
        },
    }
</script>
